#Вариант 11. Дано целое число, лежащее в диапазоне 1-999. Вывести его строку-оптсание вида
# "четное двузначное число","нечетное трехзначное число" и т.д.
num = input("Введите челое число от 1 до 999: ")

# Обработка исключений
while type(num) != int:
    try:
        num = int(num)
        # Корректное ли число было введено
        if not (1<= num <= 999):
            print("Число не подходит!")
            num = input("Введите целое число от 1 до 999:")
    except ValueError:
        print("Неправильно ввели!")
        num = input("Введите целое число от 1 до 999:")
# Определим четность числа
if num % 2 == 0:
    a = "четное"
else:
    a = "нечетное"
# Определим разряд числа
if num < 10:
    b = "однозначное"
elif num < 100:
    b = "двузначное"
else:
    b = "трехзначное"

print (a,b,"число")