# Вариант 11. Даны два целых числа. А, В. проверить истинность высказывания
# "Числа А и В Имеют одинаковую четность".

# Введите двузначное число
A, B = input("Введите первое число:"), input("Введите второе число:")

while type(A) != int: # обработка исключений
    try:
        A = int(A)
    except ValueError:
        print("Неправильно ввели!")
        A = input("Введите первое число:")
while type(B) != int: # обработка исключений
    try:
        B = int(B)
    except ValueError:
        print("Неправильно ввели!")
        B = input("Введите второе число:")

# Проверка истинности высказывания об одинаковой чётности
if A % 2 == B % 2:
    print ("Истина: числа имеют одинаковую четность")
else:
    print("Ложь. Числа имеют разную четность")