# Вариант 11. Дано двузначное число. Вывести вначале его левую цифру(десятки),
# а затем - его правую цифру (единицы). Для нахождения десятков использовать операцию
# деления нацело, для нахождения единиц - операцию взятия остатка от деления.

try:

    # Нужно ввести двузначное число
    num = int(input("Введите двузначное число:"))
    # Проверяем, является ли число двузначным
    if 10 <= abs(num) <= 99:
        # Для нахождения десятков делим число нацело на 10
        tens = abs(num) // 10
        # Для нахождения единиц берем остаток от деления на 100
        ones = abs(num) % 10
        # Выводим результат
        print(f"Левая цифра (десятки) : {tens}")
        print(f"Правая цифра (единицы) : {ones}")
    else:
        print("Ошибка!")
except ValueError:
    # Этот блок сработает, если будут введены некорректные данные
    print(" Ошибка!Введенны некорректные данные")
